Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: སྣང་བའི་ཡེ་ཤེས་མཁས་པ་ལ་འཇུག་པ་ནས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་སྙིང་པོ་འཛིན་པའི་བར་གྱི་གཟུངས་འདི་སེམས་ཅན་རྣམས་ཀྱི་གཟི་བརྗིད་དང་། ཁ་དོག་དང་། ལོངས་སྤྱོད་དང་། སྟོབས་དང་། གྲགས་པ་དང་། བདེ་བ་ལ་རེག་པར་གནས་པ་དང་། སྤོབས་པ་དང་། དྲན་པ་རྣམ་པར་འཕེལ་བ་དང་། ཐོས་པ་འཛིན་པ་མི་བརྗེད་པ་དང་། དགྲ་ཐམས་ཅད་ཕམ་པར་བགྱིད་པ་དང་། ལོ་ཏོག་མངོན་པར་འགྲུབ་པ་དང་། བསླབ་པ་འཛིན་པ་དང་། དྲན་པའི་སྣོད་དུ་འགྱུར་བ་དང་། སྤྱོད་པ་མངོན་པར་འགྲུབ་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་ཡང་དག་པར་ཐོབ་པར་བགྱི་བའི་སླད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གཟུངས་འདི་ད་འདིར་བདག་ཅག་ལ་བཤད་དུ་གསོལ།
en: fosters proficiency in conventional knowledge, . . . and contains the essence of the thirty-seven factors of awakening. “Please teach us this dhāraṇī in order to bring beings into contact with charismatic splendor, health, enjoyments, strength, good reputation, happiness, and a comfortable life; to increase eloquence and the powers of recollection and make us able to remember what has been heard without any loss of detail; to defeat all enemies; to ensure good harvests; to bring the power to retain what has been learned and become a receptacle of mindfulness;

source: ཆོས་ཀྱི་ཚུལ་རྗེས་སུ་གཟུང་བ་དང་། ཡུན་རིང་དུ་གནས་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་ཆུད་མི་འཛའ་བ་དང་། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་ལམ་མཐའ་དག་བསྟན་པ་དང་། ཡང་དག་པའི་མཐའ་དང་། ནམ་མཁའ་དང་། དེ་བཞིན་ཉིད་དབྱེར་མ་མཆིས་པ་དང་། མུན་པ་དང་། སྣང་བ་དང་། དམིགས་པ་དང་། མི་དམིགས་པ་དང་། ཚུ་རོལ་དང་། ཕ་རོལ་དང་། རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་ཐམས་ཅད་དབྱེར་མ་མཆིས་པ་དང་། ཆོས་ཐམས་ཅད་མི་སྐྱེ་བ་དང་། མི་འབྱུང་བ་དང་། མི་འགག་པ་མཉམ་པ་ཉིད་ཀྱི་མཚན་ཉིད་དངོས་པོ་མ་མཆིས་ཤིང་ཡང་དག་པའི་མཐའ་དབྱེར་མ་མཆིས་པ་དང་། ས་དང་། ཆུ་དང་། མེ་དང་། རླུང་དང་། ནམ་མཁའ་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་དབྱེར་མ་མཆིས་པའི་སླད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་འདིར་བདག་ཅག་ལ་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་གྱི་དཀྱིལ་འཁོར་དམ་པའི་གཟུངས་བཤད་དུ་གསོལ།
en: and to help accomplish the right conduct and attain awakening. “Please, O blessed buddhas, teach this dhāraṇī to us now so that this Dharma method will be upheld and remain for a long time and so that the lineage of the Three Jewels does not perish. Teach it to show the complete path to unsurpassable awakening. Teach it to show the indivisibility of the ultimate reality, space, and suchness and the indivisibility of darkness, light, the observable, the unobservable, near, far, thought, concept, beings, the vital principle, individual soul, and person. Teach it to show that all phenomena are insubstantial, undifferentiable from the ultimate reality, and equal in their characteristic of not being born, arising, or ceasing. And teach it to show the indivisibility of the elements of earth , water, fire, wind, space, and consciousness.

source: གང་འདིར་ཐོས་མ་ཐག་ཏུ་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་དག་ལ་དཀོན་མཆོག་གསུམ་མངོན་སུམ་དུ་གྱུར་ཅིག །སེམས་ཅན་རྣམས་ཕན་ཚུན་དུ་དགེ་བའི་བཤེས་གཉེན་བགྱིད་ཅིང་ཕན་པར་བགྱིད་པར་གྱུར་ཅིག །སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དང་། ལུང་བསྟན་པ་ཐོབ་པར་གྱུར་ཅིག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཆོས་བསྟན་པའི་ཕྱིར་ཅང་མི་གསུང་བར་གྱུར་པས་གནང་ནས་པད་མའི་སྙིང་པོ་དེ་དག་ལ་བཞུགས་སོ།
en: “May all the blessed buddhas here recite for us this dhāraṇī, promulgated as the collection of all the Dharma teachings that constitute the path, so that, immediately upon hearing it, innumerable hundreds of thousands of millions of billions of beings directly realize the nature of the Three Jewels. May they then work as spiritual friends for each other’s benefit. May an infinite number of beings develop the wish to attain unsurpassable, perfect awakening, reach the stage of a non-returner, and each obtain a prophecy of attaining buddhahood.” Thus addressed, all the blessed buddhas, now assuming responsibility for the delivery of the Dharma, fell silent and remained seated on their seats of lotus filaments.

source: །ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བར་འགྱུར་བ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསགས་པའི་ཕྱིར་དྲན་པ་དང་། དད་པ་དང་། དང་བ་དང་། མོས་པ་རྙེད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བ་རྣམས་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ལྟ་བ་ངན་པ་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་དང་། ཐེ་ཚོམ་དང་། ཉེ་བར་ལེན་པ་དང་། སྲིད་པའི་སྲེད་པ་ཀུན་གཞིའི་ཉེས་པ་དག་རབ་ཏུ་ཞི་བར་འགྱུར་བ་དང་། སེམས་ཅན་སོ་སོ་ནས་འདི་སྙམ་དུ་བདག་གཅིག་པུ་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་ཆོས་ཉན་པའི་ཕྱིར་འདུག་གི་འདི་ན་གཞན་སུ་ཡང་མེད་དོ།
en: They entered an absorption that manifests equanimity according to the former aspirations of a buddha. All the beings in all these buddha fields gained mindfulness, faith, inspiration, and devotion that served to quell all forms of suffering and to gather all roots of virtue. By merely beholding the blessed buddhas, the attachment, aggression, delusion, wrong views, pride, arrogance, haughtiness, personalistic false views, doubt, acquisition, craving for existence, and faults in the substratum comprising the minds and mental states of all the beings in all these buddha fields were all quelled. Each and every one of these beings had this perception: “It is just me alone that is here to hear the Dharma before the Thus-Gone One. There is no one else!

source: །བདག་གཅིག་པུ་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་ཐམས་ཅད་ཀྱིས་དགོངས་ཏེ་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པར་བཞེད་དོ།
en: The entirety of the Blessed One’s mind is directed toward me. He is teaching me the Dharma in order to alleviate all forms of sickness.

source: །འདི་ན་གཞན་སུས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་མཉན་པའི་ཕྱིར་གསོལ་བ་མ་བཏབ་བོ་སྙམ་དུ་ཤེས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་སྨོན་ལམ་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: No one else has requested the Thus-Gone One so as to hear the Dharma.” This perception was possible because the buddhas entered an absorption that manifests impartiality according to the former aspirations of a buddha.

source: །ཡང་དེའི་ཚེ་གང་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་འདིར་གཏོགས་པའི་སེམས་ཅན་རྣམས་དབང་པོ་ཐམས་ཅད་བསྟན་ཏེ་ཐལ་མོ་སྦྱར་ནས་དེ་དག་གིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Whatever beings dwelled at that time in this entire buddha field, all of them, their senses alert, folded their hands and said in one voice:

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བདག་ཅག་ལ་ཆོས་བཤད་དུ་གསོལ།
en: “Please teach us the Dharma, O blessed buddhas!

source: བཙུན་པ་བདེ་བར་གཤེགས་པ་རྣམས་ཀྱིས་བདག་ཅག་ལ་ཆོས་བཤད་དུ་གསོལ།
en: Teach us the Dharma, venerable blissful ones!

source: བདག་ཅག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ནན་ཏན་གྱིས་བསྡུ་བར་བགྱིའོ།
en: We will apply ourselves to the teachings of the blessed buddhas with earnestness.”

source: །དེ་ནས་ཡང་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་རྣམས་ལ་མཆོད་པའི་ཕྱིར་སྤོས་བཀོད་པ་ལས་ཤིན་ཏུ་ལྷག་པའི་སྤོས་གོང་དུ་མཆོག་ཏུ་ཁྱད་པར་དུ་གྱུར་པ་རྒྱ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ཁྱབ་པར་བྱིན་གྱིས་བརླབས་སོ།
en: At this point, the thus-gone Śākyamuni, in order to worship the other blessed buddhas, flooded this entire buddha field, through his blessings, with an exquisite and particularly powerful fragrance, far exceeding that of the already present array of aromas.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལྷག་མ་རྣམས་མཆོད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལག་པ་རིན་པོ་ཆེ་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་སྣ་ཚོགས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་སྣ་ཚོགས་དག་གིས་གང་བར་བྱིན་གྱིས་བརླབས་ནས་འདི་སྐད་ཅེས་གསུངས་སོ།
en: And he placed in the hands of all the beings that were in all the buddha fields various jewels, flowers, chaplets, scented oils, parasols, banners, flags, ornaments, and embellishments, so that they could themselves worship the remaining blessed buddhas.

source: །ད་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ནས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དྲི་བའི་ཕྱིར་བྱོན་པ་རྣམས་དགོངས་སུ་གསོལ།
en: He then said, “I beg your attention, O blessed buddhas in the other buddha fields in the ten directions. Please come to my buddha field so we may have a discussion.

source: བདག་སྔོན་གྱི་སྨོན་ལམ་གྱིས་འདི་འདྲ་བར་རབ་ཏུ་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། སེམས་ཅན་བསམ་པ་ཉམས་པ། ལམ་རབ་ཏུ་སྟོར་བ། མ་རིག་པའི་མུན་པ་དང་རབ་རིབ་ཀྱི་ལིང་ཏོག་གིས་ཉོན་མོངས་པའི་མུན་པར་བཅུག་པ།
en: I made the aspiration in the past to awaken fully and completely to unsurpassed and perfect awakening in this world debased by the five degenerations, to take responsibility for liberating all beings from the weariness caused by heat, cold, and hot winds;

source: ངན་སོང་གསུམ་དུ་བཞུགས་པ། མི་དགེ་བ་དང་འགྲོགས་པ། དགེ་བ་ཐམས་ཅད་དང་བྲལ་བ། མཁས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྤངས་པ། མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ།
en: for liberating, out of compassion, all the beings who have lost their sanity, lost their way, or, veiled by the dark veil of ignorance, been thrown into the darkness of afflictions; and for all the beings who are on their way to being reborn in the three miserable realms, who fall into bad company and are deprived of good company, who spurn the wise, who commit the five acts of immediate retribution, who reject the sacred Dharma, who revile the noble ones, and who have no compassion in their hearts.

source: སྙིང་རྗེ་མེད་པའི་བསམ་པ་ཅན་གྱི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བའི་སླད་དུ་སྙིང་བརྩེ་བ་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཀྱི་བརྩོན་པ་ཆེན་པོས་གྲང་བ་དང་། དྲོ་བ་དང་། རླུང་དང་། ཚ་བ་དང་། ངལ་བ་དང་། ཆད་པ་དང་དུ་བླང་བར་བགྱིའོ།
en: I do this with the diligence, power, and effort that arise out of great compassion.

source: །གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་དང་། ཡུལ་འཁོར་དུ་རྐང་གིས་འགྲོ་བར་བྱའོ།
en: Traveling on foot, I visit villages, towns, cities, countries, and capital cities.

source: །སེམས་ཅན་ལ་ཕན་པར་བགྱི་བའི་སླད་དུ་རྩུབ་པ་དང་། ཉུང་བ་དང་། རོ་མེད་པ་ཤིན་ཏུ་སྨད་པ། མི་འཐུན་པའི་ཟས་བཟའ་བར་བགྱིའོ། །དེ་དག་གི་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སླད་དུ་སྦོམ་པ་རྩུབ་པ། རེག་ན་མི་བདེ་བ། ཤ་ན་དང་། ཤིང་བལ་དང་། གསོ་མའི་རས་དང་། ཕྱག་དར་ཁྲོད་ཀྱི་གོས་བགོ་བར་བགྱིའོ།
en: To benefit beings, I consume small quantities of harsh and disagreeable food, tasteless and utterly disgusting.

source: །རི་དང་། རི་སུལ་དང་། ནགས་སྟུག་པོ་དང་། གྲོང་སྟོང་དང་། དུར་ཁྲོད་དུ་གནས་པར་བགྱི་བ་ནས་རྩྭའི་མལ་ཆ་དང་། གསོ་མ་དང་། ཤིང་གི་འདབ་མ།
en: To develop their roots of virtue, I wear coarse rags for robes, unpleasant to the touch, made from scraps of cotton and hemp salvaged from garbage dumps. I live in places such as mountain wildernesses, forest thickets, deserted towns, or charnel grounds.

source: རྩུབ་པ། དྲི་མི་ཞིམ་པ། རེག་ན་མི་བདེ་བའི་མལ་ཆ་སྤྱད་པར་བགྱིའོ། །བདག་གིས་ཐབས་མཁས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་བགོས་ནས་སེམས་ཅན་རྣམས་ལ་གཏམ་རྣམ་པ་སྣ་ཚོགས་བགྱི་སྟེ། རྒྱལ་རིགས་རྣམས་ལ་ནི་རྒྱལ་སྲིད་དང་དབང་ཕྱུག་གི་གཏམ་བགྱིའོ།
en: I make my bedding from hemp, sticks, and leaves—rough, stale-smelling, and unpleasant to the touch. Donning the armor of skillful means, great compassion, and diligence, I engage beings in conversation in various ways.

source: །བྲམ་ཟེ་རྣམས་ལ་ནི་རིག་བྱེད་དང་། སྐར་མའི་གཏམ་དང་། བློན་པོ་རྣམས་ལ་ནི་ཡུལ་དང་ལས་ཀྱི་མཐའི་གཏམ་དང་། སྨན་པ་རྣམས་ལ་ནི་ཁམས་དང་། སྨན་དང་། བསྒྲུབ་པའི་གཏམ་དང་། ཚོང་པ་རྣམས་ལ་ནི་ཉོ་ཚོང་གི་གཏམ་དང་། དམངས་རྣམས་ལ་ནི་ལས་ཀྱི་མཐའ་ལ་མངོན་པར་ཞེན་པའི་གཏམ་དང་། བུད་མེད་རྣམས་ལ་ནི་ཁ་དོག་དང་། རྒྱན་དང་། བུ་དང་། ཕྱུག་པ་དང་། འགྲན་ཟླ་མེད་པའི་གཏམ་དང་། དགེ་སྦྱོང་རྣམས་ལ་བཟོད་པ་དང་། དེས་པ་དང་། ལས་གསུམ་ལ་བརྩོན་པའི་གཏམ་བགྱིའོ།
en: With kṣatriyas, I talk about the might of the king, with brahmins about the Vedas and astrology, with ministers about the administration of the country. I talk with physicians about the efficacy of mineral and herbal remedies, with merchants about buying and selling merchandise, and with householders about responsibilities pertaining to the affairs of the house. I talk with women about beauty, jewelry, pregnancy, and avoiding petty competition. With monks I discuss the delights of acceptance, good character, and the three types of activity. “In order to bring beings to maturity, I set on the path of attainment those who have not yet reached it.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་མ་ཐོབ་པ་ཐོབ་པར་བགྱི་བ་དང་། མངོན་དུ་མ་བགྱིས་པ་མངོན་དུ་བགྱི་བར་གཟུད་དོ།
en: I help those not yet realized to attain realization, those who have not had a direct experience to have it, and those who are not yet liberated to become so.

source: །མ་ཐར་བ་རྣམས་རབ་ཏུ་ཐར་བར་བགྱི་བའི་སླད་དུ་སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ལ་སྤྲོ་བར་བགྱིའོ།
en: I relieve a variety of sufferings.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་ཡུལ་ཐམས་ཅད་དུ་རྒྱུ་བར་བགྱིའོ།
en: I travel the country in order to bring beings to maturity.

source: །དེ་ལྟ་མོད་ཀྱི་སེམས་ཅན་འདི་དག་ནི་དེ་ན་བདག་ལ་གཤེའོ། །མི་སྙན་པ་ཟེར་རོ། །ཕྲག་དོག་གི་ཆོས་ཀྱི་རྒྱུས་བདག་ལ་འཁྲིག་པའི་ཆོས་ཀྱིས་མེད་པ་ལ་སྐུར་པ་འདེབས་སོ།
en: “At such times, these beings curse and abuse me.

source: །ཁ་གསག་དང་། ཚུལ་འཆོས་པ་དང་། སྒྱུ་དང་། གཡོ་དང་། བརྫུན་སྨྲ་བ་དང་། ཞེ་གཅོད་པ་དང་། བུད་མེད་ཀྱི་ཚིག་དག་གིས་སྐུར་པ་འདེབས་སོ།
en: Filled with envy, they falsely accuse me of indulging in sex. They harass me with hypocritical gossip and women’s tales—treacherous, wicked, untrue, and mean. They throw dirt upon me.

source: བདག་ལ་སས་འཐོར་རོ། །བདག་ལ་གསད་པའི་ཕྱིར་མཚོན་དང་། དུག་དང་། མེ་དང་། འཁོར་ལོ་དང་། མདའ་བོ་ཆེ་དང་། མདའ་དང་། རལ་གྲི་དང་། མདུང་དང་། དགྲ་སྟ་དང་། རྡོ་དང་། མཚོན་ཆའི་ཆར་འབེབས་སོ།
en: They boldly approach me to slay me with weapons, poison, and fire, raining upon me discuses, javelins, arrows, swords, spears, axes, and rocks.

source: །བདག་གསད་པའི་ཕྱིར་གླང་པོ་ཆེ་དང་། སྦྲུལ་གདུག་པ་དང་། སེང་གེ་དང་། སྟག་དང་། གླང་དང་། མ་ཧེ་དང་། སྤྱང་ཀི་དང་། ཕག་རྒོད་དང་། ཚན་པོ་ཆེ་རྣམས་ཀྱང་འགྱེད་དོ།
en: In order to kill me, they set upon me elephants, venomous snakes, lions, tigers, bulls, buffaloes, wolves, and athletes.

source: །བདག་གི་གནས་དང་། གནས་ཁང་དང་། གཙུག་ལག་ཁང་ཡང་མི་གཙང་བ་དང་། དྲི་ང་བས་འགེངས་སོ། །བདག་གི་ཉན་ཐོས་གྲོང་ཁྱེར་དུ་བཞུགས་པ་རྣམས་ལ་འཕགས་པ་མ་ཡིན་པའི་སེམས་ཅན་རྣམས་ཀྱིས་གླུ་དང་གར་ཚུལ་མ་ཡིན་པ་བྱེད་དུ་འཛུད་དོ།
en: They fill up my houses, monasteries, and temples with filth and foul odors. When my hearers enter a town to beg alms, these ignoble beings rudely follow them in the streets, dancing and singing.

source: །ཐབས་བརྒྱ་སྟོང་དུ་མས་བདག་གསད་པའི་ཕྱིར་བརྩོན་ནོ། །བདག་གི་བསྟན་པ་ནུབ་པར་བྱ་བ་དང་། ཆོས་ཀྱི་ཚུལ་གྱི་སྒྲོན་མ་གསད་པ་དང་། ཆོས་ཀྱི་གྲུ་བཤིག་པ་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་བསྙལ་བ་དང་། བདག་གི་ཆོས་ཀྱི་མཆོད་སྦྱིན་རྣམ་པར་གཏོར་བའི་ཕྱིར་བརྩོན་ནོ།
en: They employ many hundreds of thousands of stratagems to kill me, striving to obliterate my doctrine, extinguish the torch showing the way to the Dharma, bring down the banner of the Dharma, break the boat of the Dharma, and scatter my Dharma offerings.

source: །ད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཆོས་ཀྱི་ཚུལ་ལ་གཟིགས་ཏེ།
en: “Now, may all of you, O blessed buddhas, look at the Dharma methods of the blessed buddhas of the past. Please consider how they had gathered together in this buddha field afflicted by the five degenerations in order to ensure the long continuity of the Dharma methods; to crush the entire force and the dominion of Māra

source: ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་པ་འདིར་འདུས་པ་ཆེན་པོ་མཛད་ནས་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བགྱི་བ་དང་། བདུད་ཀྱི་སྟོབས་ཀྱི་ཡུལ་ཐམས་ཅད་རབ་ཏུ་གཞོམ་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་གནས་པ་རྒྱུན་མི་འཆད་པར་བགྱི་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་འཕེལ་བར་བགྱི་བ་དང་། དགྲ་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་འཐབ་པ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། འཆིང་བ་དང་། འགྱེད་པ་དང་། རྒོལ་བ་དང་། དུས་མ་ཡིན་པར་གྲང་བ་དང་། ཚ་བ་དང་། ཆར་པ་དང་། རླུང་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཉེས་པ་དང་། ལྟ་བ་ངན་པ་ཡ་ང་བ་རབ་ཏུ་ཞི་བར་བགྱི་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་འདུན་པར་བགྱི་བ་དང་། ཁྱིམ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་ཐམས་ཅད་བསྲུང་བ་དང་། གཡོ་དང་། དུག་དང་། བྱད་དང་། རྨོངས་བྱེད་དང་། རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་ཐམས་ཅད་གཞིལ་བ་དང་། འབྲུ་དང་། སྨན་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། བཅུད་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཉེ་བར་འཚོ་བར་བགྱི་བ་དང་། རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། དམངས་རིགས་དང་། རྗེའུ་རིགས་རྣམས་དགེ་བ་སྤྱོད་པ་ལ་གཟུད་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་རབ་ཏུ་བསྐྱེད་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་གཟུད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཐབས་ཤེས་པ་ལ་མཁས་པ་དང་། དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོག་པ་དང་། མོས་པ་དང་། དཔའ་བ་དང་། བརྟན་པ་དང་། སྤོབས་པ་རྣམ་པར་འཕེལ་བར་བགྱི་བ་དང་། དབང་བསྐུར་བའི་སར་དབུགས་དབྱུང་བ་ལ་འཛུད་ཅིང་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་འགྲོ་བར་བགྱི་བའི་སླད་དུ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བགྱི་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་ཅིང་བྱིན་གྱིས་བརླབས་ཏེ།
en: to prevent the interruption of the continuity of the lineage of the Three Jewels; to increase beings’ roots of virtue; to suppress the proclamations of all the hostile preachers of other doctrines; to pacify discord, quarrels, famine, disease, invasions by foreign powers, enslavement, wars, disputes, unseasonable cold and hot spells, storms, torrential rains, hurricanes, the defects of body, speech, and mind, and wrong views; to propitiate all the gods, nāgas, yakṣas, and human and nonhuman beings; to protect every house, village, town, city, and kingdom; to dispel all the wickedness, poison, evil spirits, blind infatuation, bad dreams, and bad omens; to provide beings with all the grain, medicine, fruits, flowers, and extracts that they need for livelihood; to engage the kṣatriyas, brahmins, vaiśyas, and śūdras in virtuous conduct; to generate the mind of awakening;

source: གཅིག་ལ་གཅིག་དགྱེས་པ་དེས་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ད་ལྟར་ཕྱོགས་བཅུ་ན་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་པ་དག་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པ་འདིར་དྲི་བའི་ཕྱིར་གཤེགས་ཏེ་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་བསྲུང་བའི་སླད་དུ་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བགྱི་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བགྱི་བ་དང་། བདུད་ཀྱི་ཡུལ་གྱི་སྟོབས་ཐམས་ཅད་རབ་ཏུ་གཞོམ་པ་དང་། ཇི་ལྟར་གོང་དུ་རྒྱས་པར་བརྗོད་པ་བཞིན་དུ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་འགྲོ་བར་བགྱི་བའི་སླད་དུ་བདག་གིས་གསོལ་བ་བཏབ་པ་ལ་ཐུགས་བརྩེ་བར་མཛད་དེ།
en: to encourage the practice of the six perfections; to increase the wisdom, skillful means, powers of recollection, mental resourcefulness, demeanor, contemplation, devotion, valor, stability, and eloquence particular to the bodhisattva great beings; and to reach the other shore of wisdom that brings the reprieve of the final bodhisattva level. “These thus-gone, worthy, perfect buddhas of the past taught, blessed, and rejoiced in each other’s giving of this Dharma discourse and exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility . So now, in exactly the same way, all of you, O blessed buddhas, who live and spend your time in the ten directions but have now come together for the sake of inquiry to this buddha field of mine afflicted by the five degenerations, who are now seated here all together, may all of you give, bless, and rejoice in each other’s offering of this Dharma discourse and exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility . “Please do this in order to ensure the long continuity of this Dharma method, to crush the entire force and dominion of Māra , . . . and to reach the other shore of unobstructed wisdom.

source: གང་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་ཤིང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པ་དང་། མི་འཇིགས་པའི་ཆོས་ཅན་དུ་འགྱུར་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་འཆད་པ་དང་། ཆོས་ཀྱི་བཅུད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་བགྱི་བའི་སླད་དུ་ལེགས་པར་བཤད་དུ་གསོལ། བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། བཤད་ནས་ཀྱང་ཕན་ཚུན་རྗེས་སུ་དགྱེས་པར་མཛད་དུ་གསོལ།
en: Do this out of regard for my wish that this sacred Dharma method will continue in this buddha field for a long time, will not be violated by any of the followers of other systems, and will not suffer annihilation, and also to ensure the continuity of the lineage of the Three Jewels, and provide sustenance to all beings by means of the nectar of Dharma.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་འདི་སྐད་ཅེས་གསུངས་སོ།
en: The blessed buddhas replied, “Yes, of course!

source: །དེ་བཞིན་དུ་བདག་ཅག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སངས་རྒྱས་ཀྱི་མཛད་པ།
en: We will certainly carry out our duties as buddhas and take charge of the Dharma situation in this buddha field.

source: ལགས་ཀྱང་བགྱི་སྟེ། ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་བགྱི་བ་དང་། བདུད་ཀྱི་ཡུལ་གྱི་སྟོབས་ཐམས་ཅད་རབ་ཏུ་གཞོམ་པ་ནས་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་འགྲོ་བར་བགྱི་བའི་བར་གྱི་སླད་དུ་བྱིན་གྱིས་བརླབ་ཅིང་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་ཀྱིས་གང་སུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཉོན་ཅིག །འདི་ལྟ་སྟེ། ཨཾ་ཀ་ར། ཨཾ་ཀ་ར། བྷཾ་ཀ་ར། པྲ་བྷཾ་ཀ་ར། བྷ་ཡ་མི་ཧ། མི་ཏྲ་མ་བྷ་སེ། ཨ་ཁེ། ཨ་ཁ། ཨཾ་བ་རེ། དོ་མེ། དོ་མད་ཏེ། ཀེ་བད་ཊེ། ཀེ་ཡཱུ་རེ། ས་མ་བཱ་ཧ་ནེ། ས་མན་ཏ་བྷ་དྲེ། དྷརྨེ། དྷརྨེ། དྷརྨ་ཀེ། ཛ་ཕ་ལེ། མི་ཏྲ་ཨ་ནུ་པཱ་ལེ། ཕ་ལ་བ་ཏེ། ག་ཎེ། ག་ཎེ། བ་རཱན་ཏེ། ཧི་ལི་ཧི་ལི། ཧི་ལི་ཧི་ལི་ཀེ། ཛམ་བྷ་བ་ཏེ། ཊ་ཀ་ཊེ། ཊ་ཀ་བ་རཱན་ཏེ། ཧི་རིན་ཏེ། ཤི་རིན་ཏེ། བིན་དུ་བ་ཏེ། གོ་བྷ་ཧེ། ཛུ་རེ་མི་ཏྲ། ཛུ་རེ། ཛུ་ཤེ། ཨ་གྲེ། ཨ་བ་མེ། ས་སྱ་ཏ་ཐ་ཏཱ་ན། ཧུ་ལུ་ཧི་ལེ། ཙན་དྲེ། ས་མ་དྷི། མེ་དྷརྨ། ཀུ་ཙུ་རུ། མུ་ཙུ་རུ། ཨ་ཙིད་ཏ། ཙི་ལི་ཙི་ལི། ལི་ཙ་བཱ་ཧ། ཙུ་ལུ་ཙུ་ལུ། མེ་ཏྲ་བཱ་ཧ། ཀུ་ལུ་ཀུ་ལུ། ས་ར་ས་ར། ཀུ་ཊུ་ཀུ་ཊུ། མ་ཧཱ་ས་ར་ས་ར། ཏུ་ཊུ་ཏུ་ཊུ། མ་ཧཱ་སཏྱ། ཧྲྀ་ད་ཡ། པུཥྤེ་སུ་པུཥྤེ། དྷུ་མ་པ་རི་ཧ་རེ། ཨ་བྷ་ཡེ། རུ་ཙི་ནེ་ཀ་ར་ཀྵེ། ཨ་ཡ་མ་སྟུ། བི་བ་ཧ། ཏི་ཏི་ལ། མ་མ་ལེ། བཱ་ཤ་ཀ། ཤི་ཤི་ར་ཤི་ཤི་ར། ལོ་ཀ་བི་ནཱ་ཡ་ཀ་བཛྲེ་བཛྲེ་དྷ་རེ་བཛྲེ་བ་ཏེ། བཛྲེ་མ་ཏེ། བཛྲེ་ད་དེ། ཙཀྲ་བཛྲེ། ཙཀྲེ་ཙ་བ་ཏེ། དྷ་རེ་དྷ་རེ། བྷ་རེ་བྷ་རེ། པུ་རེ་ཏརེ། ཧུ་ཧུ་རེ།
en: To ensure that this Dharma method continues for a long time, to crush the entire force and the dominion of Māra , . . . and to reach the other shore of unobstructed wisdom, we will give this Dharma discourse and exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility

source: བྷཾ་ག་བཾ་བ་རེ་ཤྭ་ར་ཤ་ཙ་ཙི་ལི་ཙུ་རུ་པཱུ་རེ། མན་ཏྲ་ཎེ། མན་ཏྲ་ཎེ། ག་ག་ར་ཎེ། མུ་དྲ་ཎེ། སརྦ་མཱུ་ཧ་ནེ།
en: All the beings who are in this buddha field, please listen!

source: དྷི་དྷི་ར་ཡ་ནི། མུ་ཁེ་ཤྭ་ར་ལ་ཡ་ནི། རྀ་ཥ་ནི་ཛ་ནི། དྷ་བ་བ་ཙི། ཙཎ་ཌ་ལ་ས་མེ། སརྦ་སཏྱ་ཨ་དྷིཥྛཱ་ན། ཨ་དྷིཥྛི་ཏེ། སིདྷྱན་ཏུ་མ་ཧ་ནཱི། ནི་ནི། པཱ་ལ་ར་ཏི། ཨོ་ཛོ་གྲེ། བི་ཙི་ནི། བཱ་ན་ཧ་ར། བུ་བུ་རེ། གུ་རུ་གུ་རུ། མུ་རུ་མུ་རུ། ཧི་ལི་ཧི་ལི། ཧ་ར་ཧ་ར། ཀ་ཀ་ནཱ་ད་བ་ཧ། ཧི་ཧི་ཏ་མ། ཨ་ཡུར་ཧ་ན་ཀཎ་ཌ་ཛྭ་ལ། བྷ་སེ་ག་ད་ནེ། ཨ་ཏ་ཧ་ནི། མཱརྒ་ཨ་བྷི་རོ་ཧ་ནི། ཕ་ལ་ས་ཏྱེ། ཨ་རོ་ཥ་བ་ཏི། ཧི་ལི་ཧི་ལི། ཡ་ཐཱ་བ་ཛ་ཡ་སྭཱ་གྲ་ཡ་ཐཱ། བ་ར་ཎ་ཙ་ཧྲྀ་ད་ཡ་བཱ་ཧ་ས་ཏྱ་པ་རི་བྷཱ་བ། མརྒ་ཨ་བྷི་རོ་ཧ་ཎེ། ཨ་ཙ་ལ་བུད་དྷི་ད་ད་པྲ་ཙ་ལ་པ་ཙ་ཡ། པིཎ་ཌ་ཧྲྀ་ད་ཡ། ཙན་དྲ་ཙ་ར་ཏེ། ཨ་ཙ་ལེ་ཤོ་དྷ་ནི། པྲ་ཀྲྀ་ཏི་མཱརྒེ། ཨི་ལི་ཨི་ལི་ལི། པྲ་བྷེ་ས་ར་པྲ་ཏེ། སརྦ་ཏྲ་ཏ་ཐཱ་ཏ། སཏྱ་ཨ་ནུ་ག་ཏེ། ཨ་ན་བ་ར་ཎ་བྲ་ཏེ། ཨ་ལ་ཐ། ཨཾ་གུ་རེ། ཤ་མི་ནི་མི་བྲ་ཧྨ་པ་ཡོ་ཧ། ཨ་ཧི་ཏ། ཨ་བྷ་ཧི། ནི་བ་ར་ཡ་བ། ཨ་ཙི་ར་མཱརྒ། ལ་ན་ལརྒུ་ས་རེ། ཏྲི་རན་ན་བང་ཤེ། དྷརྨ་ཀཱ་ཡ། ཛ་ལ་ཙྪན་དྲེ། ས་མུ་དྲ་བ་ཏི། མ་ཧཱ་ད་བྷཱུ་ཏ་བྱ་ཡ། ས་མུ་དྲ་བེ་གཱ་བ་དྷ་ར་ཎི། མུ་དྲེ་ཎ། མུ་ཁི་མུ་དྲ། སུ་ར་པྲ་ཏི་སམ་བི་དྷ། ས་མུ་དྲ། ཨབརྟ་ནི། སཾ་མོ་ཧ་སྐ་ར། བིདྱུ་ཏ་ར་སེ་ན་ཀྵི་ཏི། མུ་དྲི་ཏོ་སི། ཡེ་ཀེ་ཙིད་པྲ་ཏི་བྷི་བཱ་ཧ། བ་ཧ་བ་ཧ་བ་ཧ། ཀི་ཊ། ཀ་བ་ཊ། ཤེ་ལ་པྲ་ཏཱི་ཏྱ་ཧྲྀ་ད་ཡེ་ན་མུ་དྲི་ཏཱ་དྷ་ར་ཎི་ན། དྷ་ར་དྷ་ར་དྷ་ར། དཱ་ན་ཏི་ལ་ཧུ་ཀྵ་སརྦ་ཧྲྀ་ད་ཡ། མུ་དྲི་ཏོ་སི་ཛུ་ད་དུ་ཛ་བ་ད་ཏ། ཛ་ཁ་བ་ཏ། སུ་མ་ཏི་པ་ཏི། མ་ཧཱ་ཨད་བྷཱུ་ཏ་མུ་དྲི་ཏ། ཡེ་ཀེ་ཙིད། ཥ་ཌཱ་ཡ་ཏ་ན་ནི་ཤྲི་ཏ་བྷུ་ཏ། ཨི་ན་མི་ནེ། ས་ཙ་ནེ། གོ་ཥ་ས་ཙ་ནེ། མུ་དྲི་ཏ།
en: This dhāraṇī-seal is:
